org/org-docs/what-is-tdd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-31 月 15:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>テスト駆動開発とは</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="m" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">テスト駆動開発とは</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. テスト駆動開発について</a>
<ul>
<li><a href="#orgheadline1">1.1. 入門サイト</a></li>
<li><a href="#orgheadline2">1.2. やりたいこと</a></li>
</ul>
</li>
<li><a href="#orgheadline7">2. 開発と機能とテスト</a>
<ul>
<li><a href="#orgheadline4">2.1. 機能とは</a></li>
<li><a href="#orgheadline5">2.2. 開発と機能</a></li>
<li><a href="#orgheadline6">2.3. 開発とテスト</a></li>
</ul>
</li>
<li><a href="#orgheadline17">3. プログラムの機能</a>
<ul>
<li><a href="#orgheadline11">3.1. 基本は関数</a>
<ul>
<li><a href="#orgheadline8">関数を呼び出すこと</a></li>
<li><a href="#orgheadline9">関数を定めること</a></li>
<li><a href="#orgheadline10">関数を呼び出すことと定めることの間にある決まりごと</a></li>
</ul>
</li>
<li><a href="#orgheadline12">3.2. 機能を要求する</a></li>
<li><a href="#orgheadline13">3.3. 機能を実現する</a></li>
<li><a href="#orgheadline14">3.4. 機能を提供する</a></li>
<li><a href="#orgheadline15">3.5. 機能を利用する</a></li>
<li><a href="#orgheadline16">3.6. 機能の要求と実現と提供と利用</a></li>
</ul>
</li>
<li><a href="#orgheadline23">4. 機能とヘッダファイル/ライブラリ</a>
<ul>
<li><a href="#orgheadline18">4.1. 機能を要求する</a></li>
<li><a href="#orgheadline19">4.2. 提供されている機能</a></li>
<li><a href="#orgheadline20">4.3. 機能の説明</a></li>
<li><a href="#orgheadline21">4.4. 機能を使うきまり</a></li>
<li><a href="#orgheadline22">4.5. 機能を利用する側と機能を提供する側とヘッダファイル</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> テスト駆動開発について</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> 入門サイト</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://www.slideshare.net/shuji_w6e/ss-15246933">テスト駆動開発入門</a> (slideshare)</li>

<li><a href="http://www.atmarkit.co.jp/ait/articles/1403/05/news035.html">超入門テスト駆動開発／振る舞い駆動開発を始めるための基礎知識 (1/3) - ＠IT</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> やりたいこと</h3>
<div class="outline-text-3" id="text-1-2">
<p>
少しづつ，以下のことを，繰り返すことで，開発を進めること：
</p>

<ul class="org-ul">
<li>まず，(テストを書くことで APIを）設計し，</li>
<li>次に，(APIを守って) 機能を実装し，</li>
<li>そして，要求を満たしていることを確かめる，</li>
<li>今回の変更が，他に影響を及ぼさないことを確かめる</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> 開発と機能とテスト</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> 機能とは</h3>
<div class="outline-text-3" id="text-2-1">
<p>
この講義では，C言語の関数の <b>働き</b> を機能といいます。
</p>

<p>
関数の働きとは，「関数に何を与えて，関数は何を計算してくれるか」です。
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> 開発と機能</h3>
<div class="outline-text-3" id="text-2-2">
<p>
機能の要求と実現を，一人で行う場合もありますし，
他人からの要求に応えて，実現を引き受ける場合もあります。
</p>

<p>
どちらの場合にも，機能を要求・利用する側と実現・提供する側に分けるこ
とで，インタフェースを守ることにより，プログラムの開発を分割し独立し
て行うことが出来ます。
</p>

<p>
多人数で開発する場合は分担開発ができるということですし，一人で開発す
る場合でも，より小さな開発へ分割できることになります。
</p>

<p>
大きなプログラムを開発する場合を考えます。大きな機能の実現が求められ
る場合，より小さな機能の組み合わせとなるよう考えます。実際，そうなっ
ていることがほとんどです。また，プログラムがたくさんの機能を要求す
る場合は，復数の機能がグループ化されたり，階層化されたりします。
この場合もやはり，より小さな開発の組み合わせとなります。
</p>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.3</span> 開発とテスト</h3>
<div class="outline-text-3" id="text-2-3">
<p>
小さな機能の組み合わせで大きな開発をおこなう場合，利用する各機能が
正しく動くことが保証されていると，スムーズに開発できます。
</p>

<p>
おかしなことが起こった場合でも，切り分けが可能になります。
</p>

<p>
テストは，誰でも時間が経過し中身を忘れても，その保証を確認できます。
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">3</span> プログラムの機能</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">3.1</span> 基本は関数</h3>
<div class="outline-text-3" id="text-3-1">
<p>
プログラム演習Iの関数の基本を思いだそう
</p>

<ul class="org-ul">
<li><a href="http://wiki.cis.iwate-u.ac.jp/~cis/prog1/pukiwiki/index.php?%E7%AC%AC10%E5%9B%9E">第a回</a> &#x2013; 6.1 関数の基本，6.2 引数と戻り値</li>
<li><a href="http://wiki.cis.iwate-u.ac.jp/~cis/prog1/pukiwiki/index.php?%E7%AC%AC11%E5%9B%9E">第b回</a> &#x2013; 6.3 変数の寿命とスコープ，6.4 再帰呼び出し</li>
</ul>
</div>

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">関数を呼び出すこと</h4>
<div class="outline-text-4" id="text-orgheadline8">
<pre class="example">
{ int value = f(1.0, "abc"); ... }
</pre>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9">関数を定めること</h4>
<div class="outline-text-4" id="text-orgheadline9">
<pre class="example">
int
f(double x, char *name)
{ ... ; return 1; }
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">関数を呼び出すことと定めることの間にある決まりごと</h4>
<div class="outline-text-4" id="text-orgheadline10">
<pre class="example">
int f(double, char *name);
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">3.2</span> 機能を要求する</h3>
<div class="outline-text-3" id="text-3-2">
<p>
このデータを与えると，こんな計算をして，こんな結果を返してくれる関数
を作ってくれませんか？
</p>

<ul class="org-ul">
<li>度数版sin関数::</li>
</ul>
<pre class="example">
double型の，ラジアンではなく，度数で計算してくれる sin 関数で，結果はfloatでね。
</pre>

<dl class="org-dl">
<dt>トランプ・カードのスーツ計算</dt><dd></dd>
</dl>
<pre class="example">
トランプのスーツを与えると，スーツの強さを整数で返してくれる関数を，お願い。
</pre>

<ul class="org-ul">
<li>カードに関する機能(群) &#x2013; モジュール</li>
</ul>
<pre class="example">
ポーカーゲームで使うカードの機能達の組。個々の機能は自由に設計してね。
</pre>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.3</span> 機能を実現する</h3>
<div class="outline-text-3" id="text-3-3">
<p>
はい，了解。こんな入力に対して，こんな風にを計算して，こんな結果を
返す関数を作りました。
</p>

<p>
こんな風につかってくださいね。
</p>

<pre class="example">
float deg_sin(double);
</pre>

<pre class="example">
int suit_int(char *);
</pre>

<pre class="example">
card.h に使い方が書いてあります。
card/ ディレクトリの下にソースがありますが，見なくても使えるはずです。
</pre>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.4</span> 機能を提供する</h3>
<div class="outline-text-3" id="text-3-4">
<p>
ヘッダファイルを作りましたので，インクルードして使ってください。本
体は，オブジェクトファイルやライブラリで提供します。ソースを見る必
要はないはずです。
</p>

<pre class="example">
degsin.h
libdeg.a
</pre>

<pre class="example">
suit.h
suit_int.o をリンクしてください。
</pre>

<pre class="example">
card.h に使い方が書いてあります。
libcard.a をリンクしてください。
</pre>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.5</span> 機能を利用する</h3>
<div class="outline-text-3" id="text-3-5">
<p>
ありがとう，では使わせてもらいます。
</p>

<div class="org-src-container">

<pre class="src src-c" id="orgsrcblock1"># include &lt;stdlib.h&gt;
# include &lt;stdio.h&gt;

# include &lt;suit.h&gt;

main()
{
  int s = suit_int("HEART");
  printf("HEART = %d\n", s);
  exit(0);
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh" id="orgsrcblock2">INCLUDE_PATH = /path/to/header_file
LIBRARY_PATH = /path/to/library
cc -I $INCLUDE_PATH main.c -L $LIBRARY_PATH -lsuit
</pre>
</div>

<p>
うまく使えました。ありがとう。
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.6</span> 機能の要求と実現と提供と利用</h3>
<div class="outline-text-3" id="text-3-6">
<p>
欲しい機能が既に存在すれば，それを再開発せずに，使えることが望まれ
ます。  欲しい機能が存在しなければ，その機能を実現し，上と同じ方法
で提供・利用することも望まれます。
</p>

<p>
機能に対する要求・実現・提供・利用が，別々に行えると融通性が高くな
ります。
</p>
</div>
</div>
</div>



<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">4</span> 機能とヘッダファイル/ライブラリ</h2>
<div class="outline-text-2" id="text-4">
<p>
三角関数を使う下記のプログラムを考えます:
</p>

<div class="org-src-container">

<pre class="src src-c"># include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;math.h&gt;
int
main()
{
  double result = sin(3.14L);
  printf("sin(3.14)=%g\n", result);
  exit(0);
}
</pre>
</div>

<p>
このソースプログラムをコンパイルし，実行形式プログラムを作成するに
は，下記コマンドを実行します:
</p>

<div class="org-src-container">

<pre class="src src-sh">%  cc -o sin314 sin314.c -lm
</pre>
</div>

<p>
実行は：
</p>

<div class="org-src-container">

<pre class="src src-sh">% ./sin314
</pre>
</div>

<p>
sin関数を計算する機能を，プログラムから利用するために，上記のプログ
ラムで行なわれていることをまとめると:
</p>

<dl class="org-dl">
<dt>提供</dt><dd>/usr/lib/libm.so ライブラリ, % nm /usr/lib/libm.so</dd>
<dt>利用</dt><dd>#include &lt;math&gt;, cc -lm</dd>
<dt>情報</dt><dd>% man 3 sin</dd>
</dl>
</div>


<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">4.1</span> 機能を要求する</h3>
<div class="outline-text-3" id="text-4-1">
<p>
数値計算プログラムから使う"三角関数の計算"機能, double sin(double);
が要求する機能。
</p>

<div class="org-src-container">

<pre class="src src-sh">grep sin /usr/include/math.h
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">4.2</span> 提供されている機能</h3>
<div class="outline-text-3" id="text-4-2">
<p>
機能を提供しているのは，Linux の数値計算ライブラリ /usr/lib/libm.so。
</p>

<div class="org-src-container">

<pre class="src src-sh">file /usr/lib/libm.so
nm /usr/lib/libm.so | grep sin
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">4.3</span> 機能の説明</h3>
<div class="outline-text-3" id="text-4-3">
<p>
ユーザはmanコマンドで使い方を知り，~#include &lt;math.h&gt;~ で sin 関数
を使うためのインタフェースを取り込み，~cc &#x2026; -lm~ で数学ライブラリ
を取り込む。
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">4.4</span> 機能を使うきまり</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>利用側のプログラムでは，利用インタフェースが記述されたヘッダファイ
ルをインクルードし，インタフェースを遵守します。</li>

<li>提供側のプログラムは，利用インタフェースが記述されたヘッダファイル
を作成し，自らそれをインクルードすることで，自身もインタフェースを
遵守します。</li>

<li>提供側は，プログラムソースは見せずに，機能をライブラリに詰め込み，
ライブラリとヘッダファイルを公開します。</li>

<li>利用側は，自身のプログラムとライブラリをリンクすることで，自身の実
行プログラムに機能を取り込むことができます。</li>
</ul>

<p>
Linux システム上で，C言語を使ってプログラム開発をおこなう際の，決まり
事です。
</p>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">4.5</span> 機能を利用する側と機能を提供する側とヘッダファイル</h3>
<div class="outline-text-3" id="text-4-5">
<p>
main関数は，sin関数（機能）を使う側です。数学ライブラリを開発する
側が，sin関数を提供する側で，math.hがsin関数を使う際の決まりごと（イン
タフェース）を定めています。
</p>

<p>
使う側は，ヘッダファイル math.h を include し，コンパイル時にエラー
が起きないことで，そのインタフェースを守っていることが保証されるの
です。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: m</p>
<p class="date">Created: 2016-10-31 月 15:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
